#include<stdio.h>

int main()
{
	//비트연산자 : <<, >>, &, |, ^(XOR), ~(NOT)
	//
	//  ---------------------------------------
    //  | sign | 64 | 32 | 16 | 8 | 4 | 2 | 1 |
	//  ---------------------------------------
    //  | 0양수|  0 |  0 |  0 | 0 | 0 | 0 | 0 |
	//  | 1음수|	|	 |	  |	  |   |	  |   |
	//  ----------------------------------------
	
	short n1 = 3;  // 0000 0011
	short n2 = 5;  // 0000 0101
	short n3 = 0;
	//n3 = n1 & n2;  // 0000 0001 // bit and 연산자
	n3 = n1 | n2;  // 0000 0111  // bit or 연산자
	printf("num = %d\n", n3);

	n3 = ~n1;
	printf("num = %d\n", n3);

	n3 = n1 ^ n2;
	printf("num = %d\n", n3);

	n3 = n1 << 2;  // n1을 왼쪽으로 2비트 이동시킴 //0011 → 1100
	printf("num = %d\n", n3);

	n3 = n2 >> 2;  // n1을 오른쪽으로 2비트 이동시킴 //0101 → 0001(오른쪽으로 이동할때는 부호가 바뀌지 않음)
	printf("num = %d\n", n3);
	
	
	return 0;
}